src/Catalogs/МестаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МестаРеализации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОтдела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойКаталогТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаталогиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Comment>для обновления расписаний в РМ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Comment>для отображения в мобильном приложении</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>для отображения в мобильном приложении</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КухняКоды</Name>
					<Comment>для синхронизации с мобильным приложением</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КухняРасшифровка</Name>
					<Comment>для отображения в мобильном приложении</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрактиръМобайлНазвание</Name>
					<Comment>для отображения в мобильном приложении</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрактиръМобайлКод</Name>
					<Comment>для синхронизации с мобильным приложением</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FoursquareVENUE_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Instagram_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КаталогиТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Каталог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КаталогиТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Станция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Станции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦенРасписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДня</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыДней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фирма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Префикс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КороткиеМеню</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КороткоеМеню</Name>
							<Comment>для новых РМ</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/МестаРеализации/Forms/ФормаЭлемента/module.bsl
Перем ТаблицаИменКолонокТарифнойСетки;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(ПараметрОбъектКопирования) Тогда
		ТипЦен = Справочники.ТипыЦен.Розничная;
	КонецЕсли;
	
	
	// Доступность ГруппыОплаты в зависимости от общих настроек 
	ИспользоватьГруппыОплаты = Константы.ИспользоватьГруппыОплаты.Получить();
	ЭлементыФормы.ГруппыОплаты.Доступность		= ИспользоватьГруппыОплаты;
	ЭлементыФормы.КоманднаяПанель1.Доступность	= ИспользоватьГруппыОплаты;
	
	Выборка = Справочники.КаталогиТоваров.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ПометкаУдаления Тогда
			Используется = КаталогиТоваров.Найти(Выборка.Ссылка) <> Неопределено;
			СписокКаталогов.Добавить(Выборка.Ссылка,,Используется);
		КонецЕсли; 
	КонецЦикла; 
	
	ФлагТипыЦенПоРасписанию = НЕ ЗначениеЗаполнено(ТипЦен);
	
	//ФормаТарифнаяСетка = Защита.ЗаполнитьТипыЦенРасписание( ?(ЗначениеЗаполнено(ПараметрОбъектКопирования), ПараметрОбъектКопирования, Ссылка), ТаблицаИменКолонокТарифнойСетки);
	
	Колонки = ЭлементыФормы.ТарифнаяСетка.Колонки;
	Колонки.Время.Данные = "Время";
	
	//Для каждого СтрокаИмен Из ТаблицаИменКолонокТарифнойСетки Цикл
	//	КолонкаЦена = Колонки.Добавить(СтрокаИмен.Цена, СтрокаИмен.ТипДня.Наименование);
	//	КолонкаЦена.Данные = СтрокаИмен.Цена;
	//	КолонкаЦена.ЭлементУправления.БыстрыйВыбор = Истина;
	//КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.ТипЦен.Видимость						= НЕ ФлагТипыЦенПоРасписанию;
	ЭлементыФормы.ТарифнаяСетка.Видимость				= ФлагТипыЦенПоРасписанию;
	ЭлементыФормы.КоманднаяПанельТарифнаяСетка.Видимость= ФлагТипыЦенПоРасписанию;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	КаталогиТоваров.Очистить();
	Для каждого Каталог Из СписокКаталогов Цикл
		Если Каталог.Пометка Тогда
			КаталогиТоваров.Добавить().Каталог = Каталог.Значение;
		КонецЕсли; 
	КонецЦикла; 
	
	Если ФлагТипыЦенПоРасписанию Тогда
		ТипыЦенРасписание.Очистить();
		
		Для каждого СтрокаИмен Из ТаблицаИменКолонокТарифнойСетки Цикл
			Для Каждого СтрокаСетки Из ФормаТарифнаяСетка Цикл
				
				Если СтрокаСетки[СтрокаИмен.Цена]<>0 ИЛИ СтрокаСетки[СтрокаИмен.Бесплатно] Тогда
					НоваяСтрока = ТипыЦенРасписание.Добавить();
					НоваяСтрока.ТипДня	= СтрокаИмен.ТипДня;
					НоваяСтрока.Время	= СтрокаСетки.Время;
					НоваяСтрока.ТипЦен	= СтрокаСетки[СтрокаИмен.Цена];
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Если ТипыЦенРасписание.Количество()=0 ТОгда
			Сообщить("Не указано расписание типов цен!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		ТипЦен = Неопределено;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		Сообщить("Не указан тип цен!", СтатусСообщения.Важное);
		Отказ = Истина;
		
	КонецЕсли;
	
	// Проверка ГруппыОплаты
	//ИспользоватьГруппыОплаты = Константы.ИспользоватьГруппыОплаты.Получить();
	//Если НЕ ИспользоватьГруппыОплаты И ГруппыОплаты.Количество() > 0 Тогда	
	//	Сообщить("На закладке ""Отчеты ФО"" таблица ""Группы оплаты"" должна быть пустой, когда в настройках общих параметров не установлен флаг ""Использовать группы оплаты"" !", СтатусСообщения.Важное);
	//	Отказ = Истина;
	//КонецЕсли;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ТарифнаяСеткаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	// проверка существования строки с таким же временем
	Если НЕ ОтменаРедактирования Тогда
		МассивСтрок = ФормаТарифнаяСетка.НайтиСтроки(Новый Структура("Время",Элемент.ТекущиеДанные.Время));
		Если МассивСтрок.Количество() > 1 Тогда
			Предупреждение("Такое время уже есть!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ТарифнаяСеткаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		ФормаТарифнаяСетка.Сортировать("Время");
	КонецЕсли;
	
КонецПроцедуры

Процедура ТарифнаяСеткаВремяНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтерфейсАдмина.ВыбратьВремяИзСписка(ЭтаФорма, Элемент);
	
КонецПроцедуры
